Revit 2026 API

# ParameterTypeIdRbsGbxmlSurfaceName Property

---

"Surface Name"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsGbxmlSurfaceName { get; }
```
```vb
Public Shared ReadOnly Property RbsGbxmlSurfaceName As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsGbxmlSurfaceName {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsGbxmlSurfaceName : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace